studies/effective-slip-length/partialSlipStudy/wedgeFstPartialSlip/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.04;

deltaT          1e-05;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.2;

functions
{
    sampleLine
    {
        type sets;
        libs            (sampling);

        interpolationScheme cell;

        setFormat       csv;

        sets
        (
            data
            {
                type    uniform;
                axis    x;
                start   (0 0 2.5e-6);
                end     (32e-3 0 2.5e-6);
                nPoints 200;
            }
        );

        fields          (U);
    }

    forces
    {
        type                  forces;
        libs                  ("libforces.so");
        patches               ("bottom");
        p                     p;
        u                     U;
        CofR                  (0 0 0);
        rho                   rhoInf;
        rhoInf                828;
        writeControl          timeStep;
        writeInterval         100;

    }
}

// ************************************************************************* //
