studies/effective-slip-length/partialSlipStudy/wedgeFstPartialSlip/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            rotatingWallVelocity;
        origin          (0 0 0);
        axis            (0 0 1);
        omega           12.5664;
    }           

   // top
   // {
   //     type            fixedValue;
   //     value           uniform (0 0 0); // to be adapted for rotation of top
   // }

    bottom
    {
        type              partialSlip;
        valueFraction     uniform  0.6068;    //1-0.54/(0.54+5/6)

	// valueFraction     uniform  0.5365;    //1-1.08/(1.08+5/4)
        
        
        //type            fixedValue;
        //value           uniform (0 0 0);
    }

    outerWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    left
    {
        type            wedge;
    }

    right
    {
        type            wedge;
    }

    axis
    {
        type            empty;
    }
}

// ************************************************************************* //
